ataradov/mcu-starter-projects/samg53/include/component/pdmic.h
/**
 * \file
 *
 * \brief Component description for PDMIC
 *
 * Copyright (c) 2017 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2017-07-05T18:00:00Z */
#ifndef _SAMG53_PDMIC_COMPONENT_H_
#define _SAMG53_PDMIC_COMPONENT_H_
#define _SAMG53_PDMIC_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAMG_SAMG53 Pulse Density Modulation Interface Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PDMIC */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define PDMIC_11237                      /**< (PDMIC) Module ID */
#define REV_PDMIC D                      /**< (PDMIC) Module revision */

/* -------- PDMIC_CR : (PDMIC Offset: 0x00) (R/W 32) Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SWRST:1;                   /**< bit:      0  Software Reset                           */
    uint32_t :3;                        /**< bit:   1..3  Reserved */
    uint32_t ENPDM:1;                   /**< bit:      4  Enable PDM                               */
    uint32_t :27;                       /**< bit:  5..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_CR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_CR_OFFSET                     (0x00)                                        /**<  (PDMIC_CR) Control Register  Offset */

#define PDMIC_CR_SWRST_Pos                  0                                              /**< (PDMIC_CR) Software Reset Position */
#define PDMIC_CR_SWRST_Msk                  (_U_(0x1) << PDMIC_CR_SWRST_Pos)               /**< (PDMIC_CR) Software Reset Mask */
#define PDMIC_CR_SWRST                      PDMIC_CR_SWRST_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_CR_SWRST_Msk instead */
#define PDMIC_CR_ENPDM_Pos                  4                                              /**< (PDMIC_CR) Enable PDM Position */
#define PDMIC_CR_ENPDM_Msk                  (_U_(0x1) << PDMIC_CR_ENPDM_Pos)               /**< (PDMIC_CR) Enable PDM Mask */
#define PDMIC_CR_ENPDM                      PDMIC_CR_ENPDM_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_CR_ENPDM_Msk instead */
#define PDMIC_CR_MASK                       _U_(0x11)                                      /**< \deprecated (PDMIC_CR) Register MASK  (Use PDMIC_CR_Msk instead)  */
#define PDMIC_CR_Msk                        _U_(0x11)                                      /**< (PDMIC_CR) Register Mask  */


/* -------- PDMIC_MR : (PDMIC Offset: 0x04) (R/W 32) Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :8;                        /**< bit:   0..7  Reserved */
    uint32_t PRESCAL:7;                 /**< bit:  8..14  Prescaler Rate Selection                 */
    uint32_t :17;                       /**< bit: 15..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_MR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_MR_OFFSET                     (0x04)                                        /**<  (PDMIC_MR) Mode Register  Offset */

#define PDMIC_MR_PRESCAL_Pos                8                                              /**< (PDMIC_MR) Prescaler Rate Selection Position */
#define PDMIC_MR_PRESCAL_Msk                (_U_(0x7F) << PDMIC_MR_PRESCAL_Pos)            /**< (PDMIC_MR) Prescaler Rate Selection Mask */
#define PDMIC_MR_PRESCAL(value)             (PDMIC_MR_PRESCAL_Msk & ((value) << PDMIC_MR_PRESCAL_Pos))
#define PDMIC_MR_MASK                       _U_(0x7F00)                                    /**< \deprecated (PDMIC_MR) Register MASK  (Use PDMIC_MR_Msk instead)  */
#define PDMIC_MR_Msk                        _U_(0x7F00)                                    /**< (PDMIC_MR) Register Mask  */


/* -------- PDMIC_CDR : (PDMIC Offset: 0x14) (R/ 32) Converted Data Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DATA:32;                   /**< bit:  0..31  Data Converted                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_CDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_CDR_OFFSET                    (0x14)                                        /**<  (PDMIC_CDR) Converted Data Register  Offset */

#define PDMIC_CDR_DATA_Pos                  0                                              /**< (PDMIC_CDR) Data Converted Position */
#define PDMIC_CDR_DATA_Msk                  (_U_(0xFFFFFFFF) << PDMIC_CDR_DATA_Pos)        /**< (PDMIC_CDR) Data Converted Mask */
#define PDMIC_CDR_DATA(value)               (PDMIC_CDR_DATA_Msk & ((value) << PDMIC_CDR_DATA_Pos))
#define PDMIC_CDR_MASK                      _U_(0xFFFFFFFF)                                /**< \deprecated (PDMIC_CDR) Register MASK  (Use PDMIC_CDR_Msk instead)  */
#define PDMIC_CDR_Msk                       _U_(0xFFFFFFFF)                                /**< (PDMIC_CDR) Register Mask  */


