ataradov/mcu-starter-projects/samg53/include/component/pdmic.h
/* -------- PDMIC_IER : (PDMIC Offset: 0x18) (/W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :24;                       /**< bit:  0..23  Reserved */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready Interrupt Enable              */
    uint32_t OVRE:1;                    /**< bit:     25  Overrun Error Interrupt Enable           */
    uint32_t :1;                        /**< bit:     26  Reserved */
    uint32_t ENDRX:1;                   /**< bit:     27  End of Receive Buffer Interrupt Enable   */
    uint32_t RXBUFF:1;                  /**< bit:     28  Receive Buffer Full Interrupt Enable     */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_IER_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_IER_OFFSET                    (0x18)                                        /**<  (PDMIC_IER) Interrupt Enable Register  Offset */

#define PDMIC_IER_DRDY_Pos                  24                                             /**< (PDMIC_IER) Data Ready Interrupt Enable Position */
#define PDMIC_IER_DRDY_Msk                  (_U_(0x1) << PDMIC_IER_DRDY_Pos)               /**< (PDMIC_IER) Data Ready Interrupt Enable Mask */
#define PDMIC_IER_DRDY                      PDMIC_IER_DRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_IER_DRDY_Msk instead */
#define PDMIC_IER_OVRE_Pos                  25                                             /**< (PDMIC_IER) Overrun Error Interrupt Enable Position */
#define PDMIC_IER_OVRE_Msk                  (_U_(0x1) << PDMIC_IER_OVRE_Pos)               /**< (PDMIC_IER) Overrun Error Interrupt Enable Mask */
#define PDMIC_IER_OVRE                      PDMIC_IER_OVRE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_IER_OVRE_Msk instead */
#define PDMIC_IER_ENDRX_Pos                 27                                             /**< (PDMIC_IER) End of Receive Buffer Interrupt Enable Position */
#define PDMIC_IER_ENDRX_Msk                 (_U_(0x1) << PDMIC_IER_ENDRX_Pos)              /**< (PDMIC_IER) End of Receive Buffer Interrupt Enable Mask */
#define PDMIC_IER_ENDRX                     PDMIC_IER_ENDRX_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_IER_ENDRX_Msk instead */
#define PDMIC_IER_RXBUFF_Pos                28                                             /**< (PDMIC_IER) Receive Buffer Full Interrupt Enable Position */
#define PDMIC_IER_RXBUFF_Msk                (_U_(0x1) << PDMIC_IER_RXBUFF_Pos)             /**< (PDMIC_IER) Receive Buffer Full Interrupt Enable Mask */
#define PDMIC_IER_RXBUFF                    PDMIC_IER_RXBUFF_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_IER_RXBUFF_Msk instead */
#define PDMIC_IER_MASK                      _U_(0x1B000000)                                /**< \deprecated (PDMIC_IER) Register MASK  (Use PDMIC_IER_Msk instead)  */
#define PDMIC_IER_Msk                       _U_(0x1B000000)                                /**< (PDMIC_IER) Register Mask  */


/* -------- PDMIC_IDR : (PDMIC Offset: 0x1c) (/W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :24;                       /**< bit:  0..23  Reserved */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready Interrupt Disable             */
    uint32_t OVRE:1;                    /**< bit:     25  General Overrun Error Interrupt Disable  */
    uint32_t :1;                        /**< bit:     26  Reserved */
    uint32_t ENDRX:1;                   /**< bit:     27  End of Receive Buffer Interrupt Disable  */
    uint32_t RXBUFF:1;                  /**< bit:     28  Receive Buffer Full Interrupt Disable    */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_IDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_IDR_OFFSET                    (0x1C)                                        /**<  (PDMIC_IDR) Interrupt Disable Register  Offset */

#define PDMIC_IDR_DRDY_Pos                  24                                             /**< (PDMIC_IDR) Data Ready Interrupt Disable Position */
#define PDMIC_IDR_DRDY_Msk                  (_U_(0x1) << PDMIC_IDR_DRDY_Pos)               /**< (PDMIC_IDR) Data Ready Interrupt Disable Mask */
#define PDMIC_IDR_DRDY                      PDMIC_IDR_DRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_IDR_DRDY_Msk instead */
#define PDMIC_IDR_OVRE_Pos                  25                                             /**< (PDMIC_IDR) General Overrun Error Interrupt Disable Position */
#define PDMIC_IDR_OVRE_Msk                  (_U_(0x1) << PDMIC_IDR_OVRE_Pos)               /**< (PDMIC_IDR) General Overrun Error Interrupt Disable Mask */
#define PDMIC_IDR_OVRE                      PDMIC_IDR_OVRE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_IDR_OVRE_Msk instead */
#define PDMIC_IDR_ENDRX_Pos                 27                                             /**< (PDMIC_IDR) End of Receive Buffer Interrupt Disable Position */
#define PDMIC_IDR_ENDRX_Msk                 (_U_(0x1) << PDMIC_IDR_ENDRX_Pos)              /**< (PDMIC_IDR) End of Receive Buffer Interrupt Disable Mask */
#define PDMIC_IDR_ENDRX                     PDMIC_IDR_ENDRX_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_IDR_ENDRX_Msk instead */
#define PDMIC_IDR_RXBUFF_Pos                28                                             /**< (PDMIC_IDR) Receive Buffer Full Interrupt Disable Position */
#define PDMIC_IDR_RXBUFF_Msk                (_U_(0x1) << PDMIC_IDR_RXBUFF_Pos)             /**< (PDMIC_IDR) Receive Buffer Full Interrupt Disable Mask */
#define PDMIC_IDR_RXBUFF                    PDMIC_IDR_RXBUFF_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_IDR_RXBUFF_Msk instead */
#define PDMIC_IDR_MASK                      _U_(0x1B000000)                                /**< \deprecated (PDMIC_IDR) Register MASK  (Use PDMIC_IDR_Msk instead)  */
#define PDMIC_IDR_Msk                       _U_(0x1B000000)                                /**< (PDMIC_IDR) Register Mask  */


/* -------- PDMIC_IMR : (PDMIC Offset: 0x20) (R/ 32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :24;                       /**< bit:  0..23  Reserved */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready Interrupt Mask                */
    uint32_t OVRE:1;                    /**< bit:     25  General Overrun Error Interrupt Mask     */
    uint32_t :1;                        /**< bit:     26  Reserved */
    uint32_t ENDRX:1;                   /**< bit:     27  End of Receive Buffer Interrupt Mask     */
    uint32_t RXBUFF:1;                  /**< bit:     28  Receive Buffer Full Interrupt Mask       */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_IMR_Type;
