ataradov/mcu-starter-projects/samg53/include/component/pdmic.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_IMR_OFFSET                    (0x20)                                        /**<  (PDMIC_IMR) Interrupt Mask Register  Offset */

#define PDMIC_IMR_DRDY_Pos                  24                                             /**< (PDMIC_IMR) Data Ready Interrupt Mask Position */
#define PDMIC_IMR_DRDY_Msk                  (_U_(0x1) << PDMIC_IMR_DRDY_Pos)               /**< (PDMIC_IMR) Data Ready Interrupt Mask Mask */
#define PDMIC_IMR_DRDY                      PDMIC_IMR_DRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_IMR_DRDY_Msk instead */
#define PDMIC_IMR_OVRE_Pos                  25                                             /**< (PDMIC_IMR) General Overrun Error Interrupt Mask Position */
#define PDMIC_IMR_OVRE_Msk                  (_U_(0x1) << PDMIC_IMR_OVRE_Pos)               /**< (PDMIC_IMR) General Overrun Error Interrupt Mask Mask */
#define PDMIC_IMR_OVRE                      PDMIC_IMR_OVRE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_IMR_OVRE_Msk instead */
#define PDMIC_IMR_ENDRX_Pos                 27                                             /**< (PDMIC_IMR) End of Receive Buffer Interrupt Mask Position */
#define PDMIC_IMR_ENDRX_Msk                 (_U_(0x1) << PDMIC_IMR_ENDRX_Pos)              /**< (PDMIC_IMR) End of Receive Buffer Interrupt Mask Mask */
#define PDMIC_IMR_ENDRX                     PDMIC_IMR_ENDRX_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_IMR_ENDRX_Msk instead */
#define PDMIC_IMR_RXBUFF_Pos                28                                             /**< (PDMIC_IMR) Receive Buffer Full Interrupt Mask Position */
#define PDMIC_IMR_RXBUFF_Msk                (_U_(0x1) << PDMIC_IMR_RXBUFF_Pos)             /**< (PDMIC_IMR) Receive Buffer Full Interrupt Mask Mask */
#define PDMIC_IMR_RXBUFF                    PDMIC_IMR_RXBUFF_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_IMR_RXBUFF_Msk instead */
#define PDMIC_IMR_MASK                      _U_(0x1B000000)                                /**< \deprecated (PDMIC_IMR) Register MASK  (Use PDMIC_IMR_Msk instead)  */
#define PDMIC_IMR_Msk                       _U_(0x1B000000)                                /**< (PDMIC_IMR) Register Mask  */


/* -------- PDMIC_ISR : (PDMIC Offset: 0x24) (R/ 32) Interrupt Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :16;                       /**< bit:  0..15  Reserved */
    uint32_t FIFOCNT:8;                 /**< bit: 16..23  FIFO Count                               */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready                               */
    uint32_t OVRE:1;                    /**< bit:     25  Overrun Error                            */
    uint32_t :1;                        /**< bit:     26  Reserved */
    uint32_t ENDRX:1;                   /**< bit:     27  End of RX Buffer                         */
    uint32_t RXBUFF:1;                  /**< bit:     28  RX Buffer Full                           */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_ISR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_ISR_OFFSET                    (0x24)                                        /**<  (PDMIC_ISR) Interrupt Status Register  Offset */

#define PDMIC_ISR_FIFOCNT_Pos               16                                             /**< (PDMIC_ISR) FIFO Count Position */
#define PDMIC_ISR_FIFOCNT_Msk               (_U_(0xFF) << PDMIC_ISR_FIFOCNT_Pos)           /**< (PDMIC_ISR) FIFO Count Mask */
#define PDMIC_ISR_FIFOCNT(value)            (PDMIC_ISR_FIFOCNT_Msk & ((value) << PDMIC_ISR_FIFOCNT_Pos))
#define PDMIC_ISR_DRDY_Pos                  24                                             /**< (PDMIC_ISR) Data Ready Position */
#define PDMIC_ISR_DRDY_Msk                  (_U_(0x1) << PDMIC_ISR_DRDY_Pos)               /**< (PDMIC_ISR) Data Ready Mask */
#define PDMIC_ISR_DRDY                      PDMIC_ISR_DRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_ISR_DRDY_Msk instead */
#define PDMIC_ISR_OVRE_Pos                  25                                             /**< (PDMIC_ISR) Overrun Error Position */
#define PDMIC_ISR_OVRE_Msk                  (_U_(0x1) << PDMIC_ISR_OVRE_Pos)               /**< (PDMIC_ISR) Overrun Error Mask */
#define PDMIC_ISR_OVRE                      PDMIC_ISR_OVRE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_ISR_OVRE_Msk instead */
#define PDMIC_ISR_ENDRX_Pos                 27                                             /**< (PDMIC_ISR) End of RX Buffer Position */
#define PDMIC_ISR_ENDRX_Msk                 (_U_(0x1) << PDMIC_ISR_ENDRX_Pos)              /**< (PDMIC_ISR) End of RX Buffer Mask */
#define PDMIC_ISR_ENDRX                     PDMIC_ISR_ENDRX_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_ISR_ENDRX_Msk instead */
#define PDMIC_ISR_RXBUFF_Pos                28                                             /**< (PDMIC_ISR) RX Buffer Full Position */
#define PDMIC_ISR_RXBUFF_Msk                (_U_(0x1) << PDMIC_ISR_RXBUFF_Pos)             /**< (PDMIC_ISR) RX Buffer Full Mask */
#define PDMIC_ISR_RXBUFF                    PDMIC_ISR_RXBUFF_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_ISR_RXBUFF_Msk instead */
#define PDMIC_ISR_MASK                      _U_(0x1BFF0000)                                /**< \deprecated (PDMIC_ISR) Register MASK  (Use PDMIC_ISR_Msk instead)  */
#define PDMIC_ISR_Msk                       _U_(0x1BFF0000)                                /**< (PDMIC_ISR) Register Mask  */


/* -------- PDMIC_DSPR : (PDMIC Offset: 0x58) (R/W 32) DSP Configuration Register 0 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t HPFBYP:1;                  /**< bit:      1  High-Pass Filter Bypass                  */
    uint32_t SINBYP:1;                  /**< bit:      2  SINCC Filter Bypass                      */
    uint32_t SIZE:1;                    /**< bit:      3  Data Size                                */
    uint32_t OSR:3;                     /**< bit:   4..6  Oversampling Ratio                       */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t SCALE:4;                   /**< bit:  8..11  Data Scale                               */
    uint32_t SHIFT:4;                   /**< bit: 12..15  Data Shift                               */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_DSPR_Type;
