ataradov/mcu-starter-projects/samg53/include/component/pdmic.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_DSPR_OFFSET                   (0x58)                                        /**<  (PDMIC_DSPR) DSP Configuration Register 0  Offset */

#define PDMIC_DSPR_HPFBYP_Pos               1                                              /**< (PDMIC_DSPR) High-Pass Filter Bypass Position */
#define PDMIC_DSPR_HPFBYP_Msk               (_U_(0x1) << PDMIC_DSPR_HPFBYP_Pos)            /**< (PDMIC_DSPR) High-Pass Filter Bypass Mask */
#define PDMIC_DSPR_HPFBYP                   PDMIC_DSPR_HPFBYP_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_DSPR_HPFBYP_Msk instead */
#define PDMIC_DSPR_SINBYP_Pos               2                                              /**< (PDMIC_DSPR) SINCC Filter Bypass Position */
#define PDMIC_DSPR_SINBYP_Msk               (_U_(0x1) << PDMIC_DSPR_SINBYP_Pos)            /**< (PDMIC_DSPR) SINCC Filter Bypass Mask */
#define PDMIC_DSPR_SINBYP                   PDMIC_DSPR_SINBYP_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_DSPR_SINBYP_Msk instead */
#define PDMIC_DSPR_SIZE_Pos                 3                                              /**< (PDMIC_DSPR) Data Size Position */
#define PDMIC_DSPR_SIZE_Msk                 (_U_(0x1) << PDMIC_DSPR_SIZE_Pos)              /**< (PDMIC_DSPR) Data Size Mask */
#define PDMIC_DSPR_SIZE                     PDMIC_DSPR_SIZE_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_DSPR_SIZE_Msk instead */
#define PDMIC_DSPR_OSR_Pos                  4                                              /**< (PDMIC_DSPR) Oversampling Ratio Position */
#define PDMIC_DSPR_OSR_Msk                  (_U_(0x7) << PDMIC_DSPR_OSR_Pos)               /**< (PDMIC_DSPR) Oversampling Ratio Mask */
#define PDMIC_DSPR_OSR(value)               (PDMIC_DSPR_OSR_Msk & ((value) << PDMIC_DSPR_OSR_Pos))
#define   PDMIC_DSPR_OSR_128_Val            _U_(0x0)                                       /**< (PDMIC_DSPR) Oversampling ratio is 128  */
#define   PDMIC_DSPR_OSR_64_Val             _U_(0x1)                                       /**< (PDMIC_DSPR) Oversampling ratio is 64  */
#define PDMIC_DSPR_OSR_128                  (PDMIC_DSPR_OSR_128_Val << PDMIC_DSPR_OSR_Pos)  /**< (PDMIC_DSPR) Oversampling ratio is 128 Position  */
#define PDMIC_DSPR_OSR_64                   (PDMIC_DSPR_OSR_64_Val << PDMIC_DSPR_OSR_Pos)  /**< (PDMIC_DSPR) Oversampling ratio is 64 Position  */
#define PDMIC_DSPR_SCALE_Pos                8                                              /**< (PDMIC_DSPR) Data Scale Position */
#define PDMIC_DSPR_SCALE_Msk                (_U_(0xF) << PDMIC_DSPR_SCALE_Pos)             /**< (PDMIC_DSPR) Data Scale Mask */
#define PDMIC_DSPR_SCALE(value)             (PDMIC_DSPR_SCALE_Msk & ((value) << PDMIC_DSPR_SCALE_Pos))
#define PDMIC_DSPR_SHIFT_Pos                12                                             /**< (PDMIC_DSPR) Data Shift Position */
#define PDMIC_DSPR_SHIFT_Msk                (_U_(0xF) << PDMIC_DSPR_SHIFT_Pos)             /**< (PDMIC_DSPR) Data Shift Mask */
#define PDMIC_DSPR_SHIFT(value)             (PDMIC_DSPR_SHIFT_Msk & ((value) << PDMIC_DSPR_SHIFT_Pos))
#define PDMIC_DSPR_MASK                     _U_(0xFF7E)                                    /**< \deprecated (PDMIC_DSPR) Register MASK  (Use PDMIC_DSPR_Msk instead)  */
#define PDMIC_DSPR_Msk                      _U_(0xFF7E)                                    /**< (PDMIC_DSPR) Register Mask  */


/* -------- PDMIC_WPMR : (PDMIC Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                  */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protect Key                        */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_WPMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_WPMR_OFFSET                   (0xE4)                                        /**<  (PDMIC_WPMR) Write Protection Mode Register  Offset */

#define PDMIC_WPMR_WPEN_Pos                 0                                              /**< (PDMIC_WPMR) Write Protection Enable Position */
#define PDMIC_WPMR_WPEN_Msk                 (_U_(0x1) << PDMIC_WPMR_WPEN_Pos)              /**< (PDMIC_WPMR) Write Protection Enable Mask */
#define PDMIC_WPMR_WPEN                     PDMIC_WPMR_WPEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_WPMR_WPEN_Msk instead */
#define PDMIC_WPMR_WPKEY_Pos                8                                              /**< (PDMIC_WPMR) Write Protect Key Position */
#define PDMIC_WPMR_WPKEY_Msk                (_U_(0xFFFFFF) << PDMIC_WPMR_WPKEY_Pos)        /**< (PDMIC_WPMR) Write Protect Key Mask */
#define PDMIC_WPMR_WPKEY(value)             (PDMIC_WPMR_WPKEY_Msk & ((value) << PDMIC_WPMR_WPKEY_Pos))
#define   PDMIC_WPMR_WPKEY_PASSWD_Val       _U_(0x414443)                                  /**< (PDMIC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define PDMIC_WPMR_WPKEY_PASSWD             (PDMIC_WPMR_WPKEY_PASSWD_Val << PDMIC_WPMR_WPKEY_Pos)  /**< (PDMIC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define PDMIC_WPMR_MASK                     _U_(0xFFFFFF01)                                /**< \deprecated (PDMIC_WPMR) Register MASK  (Use PDMIC_WPMR_Msk instead)  */
#define PDMIC_WPMR_Msk                      _U_(0xFFFFFF01)                                /**< (PDMIC_WPMR) Register Mask  */


/* -------- PDMIC_WPSR : (PDMIC Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status        */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protection Violation Source        */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_WPSR_Type;
