ataradov/mcu-starter-projects/samg53/include/component/pdmic.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_WPSR_OFFSET                   (0xE8)                                        /**<  (PDMIC_WPSR) Write Protection Status Register  Offset */

#define PDMIC_WPSR_WPVS_Pos                 0                                              /**< (PDMIC_WPSR) Write Protection Violation Status Position */
#define PDMIC_WPSR_WPVS_Msk                 (_U_(0x1) << PDMIC_WPSR_WPVS_Pos)              /**< (PDMIC_WPSR) Write Protection Violation Status Mask */
#define PDMIC_WPSR_WPVS                     PDMIC_WPSR_WPVS_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_WPSR_WPVS_Msk instead */
#define PDMIC_WPSR_WPVSRC_Pos               8                                              /**< (PDMIC_WPSR) Write Protection Violation Source Position */
#define PDMIC_WPSR_WPVSRC_Msk               (_U_(0xFFFF) << PDMIC_WPSR_WPVSRC_Pos)         /**< (PDMIC_WPSR) Write Protection Violation Source Mask */
#define PDMIC_WPSR_WPVSRC(value)            (PDMIC_WPSR_WPVSRC_Msk & ((value) << PDMIC_WPSR_WPVSRC_Pos))
#define PDMIC_WPSR_MASK                     _U_(0xFFFF01)                                  /**< \deprecated (PDMIC_WPSR) Register MASK  (Use PDMIC_WPSR_Msk instead)  */
#define PDMIC_WPSR_Msk                      _U_(0xFFFF01)                                  /**< (PDMIC_WPSR) Register Mask  */


/* -------- PDMIC_RPR : (PDMIC Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXPTR:32;                  /**< bit:  0..31  Receive Pointer Register                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_RPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_RPR_OFFSET                    (0x100)                                       /**<  (PDMIC_RPR) Receive Pointer Register  Offset */

#define PDMIC_RPR_RXPTR_Pos                 0                                              /**< (PDMIC_RPR) Receive Pointer Register Position */
#define PDMIC_RPR_RXPTR_Msk                 (_U_(0xFFFFFFFF) << PDMIC_RPR_RXPTR_Pos)       /**< (PDMIC_RPR) Receive Pointer Register Mask */
#define PDMIC_RPR_RXPTR(value)              (PDMIC_RPR_RXPTR_Msk & ((value) << PDMIC_RPR_RXPTR_Pos))
#define PDMIC_RPR_MASK                      _U_(0xFFFFFFFF)                                /**< \deprecated (PDMIC_RPR) Register MASK  (Use PDMIC_RPR_Msk instead)  */
#define PDMIC_RPR_Msk                       _U_(0xFFFFFFFF)                                /**< (PDMIC_RPR) Register Mask  */


/* -------- PDMIC_RCR : (PDMIC Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXCTR:16;                  /**< bit:  0..15  Receive Counter Register                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_RCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_RCR_OFFSET                    (0x104)                                       /**<  (PDMIC_RCR) Receive Counter Register  Offset */

#define PDMIC_RCR_RXCTR_Pos                 0                                              /**< (PDMIC_RCR) Receive Counter Register Position */
#define PDMIC_RCR_RXCTR_Msk                 (_U_(0xFFFF) << PDMIC_RCR_RXCTR_Pos)           /**< (PDMIC_RCR) Receive Counter Register Mask */
#define PDMIC_RCR_RXCTR(value)              (PDMIC_RCR_RXCTR_Msk & ((value) << PDMIC_RCR_RXCTR_Pos))
#define PDMIC_RCR_MASK                      _U_(0xFFFF)                                    /**< \deprecated (PDMIC_RCR) Register MASK  (Use PDMIC_RCR_Msk instead)  */
#define PDMIC_RCR_Msk                       _U_(0xFFFF)                                    /**< (PDMIC_RCR) Register Mask  */


/* -------- PDMIC_RNPR : (PDMIC Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNPTR:32;                 /**< bit:  0..31  Receive Next Pointer                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_RNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_RNPR_OFFSET                   (0x110)                                       /**<  (PDMIC_RNPR) Receive Next Pointer Register  Offset */

#define PDMIC_RNPR_RXNPTR_Pos               0                                              /**< (PDMIC_RNPR) Receive Next Pointer Position */
#define PDMIC_RNPR_RXNPTR_Msk               (_U_(0xFFFFFFFF) << PDMIC_RNPR_RXNPTR_Pos)     /**< (PDMIC_RNPR) Receive Next Pointer Mask */
#define PDMIC_RNPR_RXNPTR(value)            (PDMIC_RNPR_RXNPTR_Msk & ((value) << PDMIC_RNPR_RXNPTR_Pos))
#define PDMIC_RNPR_MASK                     _U_(0xFFFFFFFF)                                /**< \deprecated (PDMIC_RNPR) Register MASK  (Use PDMIC_RNPR_Msk instead)  */
#define PDMIC_RNPR_Msk                      _U_(0xFFFFFFFF)                                /**< (PDMIC_RNPR) Register Mask  */


/* -------- PDMIC_RNCR : (PDMIC Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNCTR:16;                 /**< bit:  0..15  Receive Next Counter                     */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_RNCR_Type;
