ataradov/mcu-starter-projects/samg53/include/component/pdmic.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_RNCR_OFFSET                   (0x114)                                       /**<  (PDMIC_RNCR) Receive Next Counter Register  Offset */

#define PDMIC_RNCR_RXNCTR_Pos               0                                              /**< (PDMIC_RNCR) Receive Next Counter Position */
#define PDMIC_RNCR_RXNCTR_Msk               (_U_(0xFFFF) << PDMIC_RNCR_RXNCTR_Pos)         /**< (PDMIC_RNCR) Receive Next Counter Mask */
#define PDMIC_RNCR_RXNCTR(value)            (PDMIC_RNCR_RXNCTR_Msk & ((value) << PDMIC_RNCR_RXNCTR_Pos))
#define PDMIC_RNCR_MASK                     _U_(0xFFFF)                                    /**< \deprecated (PDMIC_RNCR) Register MASK  (Use PDMIC_RNCR_Msk instead)  */
#define PDMIC_RNCR_Msk                      _U_(0xFFFF)                                    /**< (PDMIC_RNCR) Register Mask  */


/* -------- PDMIC_PTCR : (PDMIC Offset: 0x120) (/W 32) Transfer Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t RXTDIS:1;                  /**< bit:      1  Receiver Transfer Disable                */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t TXTDIS:1;                  /**< bit:      9  Transmitter Transfer Disable             */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t RXCBDIS:1;                 /**< bit:     17  Receiver Circular Buffer Disable         */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t TXCBDIS:1;                 /**< bit:     19  Transmitter Circular Buffer Disable      */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t ERRCLR:1;                  /**< bit:     24  Transfer Bus Error Clear                 */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_PTCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_PTCR_OFFSET                   (0x120)                                       /**<  (PDMIC_PTCR) Transfer Control Register  Offset */

#define PDMIC_PTCR_RXTEN_Pos                0                                              /**< (PDMIC_PTCR) Receiver Transfer Enable Position */
#define PDMIC_PTCR_RXTEN_Msk                (_U_(0x1) << PDMIC_PTCR_RXTEN_Pos)             /**< (PDMIC_PTCR) Receiver Transfer Enable Mask */
#define PDMIC_PTCR_RXTEN                    PDMIC_PTCR_RXTEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTCR_RXTEN_Msk instead */
#define PDMIC_PTCR_RXTDIS_Pos               1                                              /**< (PDMIC_PTCR) Receiver Transfer Disable Position */
#define PDMIC_PTCR_RXTDIS_Msk               (_U_(0x1) << PDMIC_PTCR_RXTDIS_Pos)            /**< (PDMIC_PTCR) Receiver Transfer Disable Mask */
#define PDMIC_PTCR_RXTDIS                   PDMIC_PTCR_RXTDIS_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTCR_RXTDIS_Msk instead */
#define PDMIC_PTCR_TXTEN_Pos                8                                              /**< (PDMIC_PTCR) Transmitter Transfer Enable Position */
#define PDMIC_PTCR_TXTEN_Msk                (_U_(0x1) << PDMIC_PTCR_TXTEN_Pos)             /**< (PDMIC_PTCR) Transmitter Transfer Enable Mask */
#define PDMIC_PTCR_TXTEN                    PDMIC_PTCR_TXTEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTCR_TXTEN_Msk instead */
#define PDMIC_PTCR_TXTDIS_Pos               9                                              /**< (PDMIC_PTCR) Transmitter Transfer Disable Position */
#define PDMIC_PTCR_TXTDIS_Msk               (_U_(0x1) << PDMIC_PTCR_TXTDIS_Pos)            /**< (PDMIC_PTCR) Transmitter Transfer Disable Mask */
#define PDMIC_PTCR_TXTDIS                   PDMIC_PTCR_TXTDIS_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTCR_TXTDIS_Msk instead */
#define PDMIC_PTCR_RXCBEN_Pos               16                                             /**< (PDMIC_PTCR) Receiver Circular Buffer Enable Position */
#define PDMIC_PTCR_RXCBEN_Msk               (_U_(0x1) << PDMIC_PTCR_RXCBEN_Pos)            /**< (PDMIC_PTCR) Receiver Circular Buffer Enable Mask */
#define PDMIC_PTCR_RXCBEN                   PDMIC_PTCR_RXCBEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTCR_RXCBEN_Msk instead */
#define PDMIC_PTCR_RXCBDIS_Pos              17                                             /**< (PDMIC_PTCR) Receiver Circular Buffer Disable Position */
#define PDMIC_PTCR_RXCBDIS_Msk              (_U_(0x1) << PDMIC_PTCR_RXCBDIS_Pos)           /**< (PDMIC_PTCR) Receiver Circular Buffer Disable Mask */
#define PDMIC_PTCR_RXCBDIS                  PDMIC_PTCR_RXCBDIS_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTCR_RXCBDIS_Msk instead */
#define PDMIC_PTCR_TXCBEN_Pos               18                                             /**< (PDMIC_PTCR) Transmitter Circular Buffer Enable Position */
#define PDMIC_PTCR_TXCBEN_Msk               (_U_(0x1) << PDMIC_PTCR_TXCBEN_Pos)            /**< (PDMIC_PTCR) Transmitter Circular Buffer Enable Mask */
#define PDMIC_PTCR_TXCBEN                   PDMIC_PTCR_TXCBEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTCR_TXCBEN_Msk instead */
#define PDMIC_PTCR_TXCBDIS_Pos              19                                             /**< (PDMIC_PTCR) Transmitter Circular Buffer Disable Position */
#define PDMIC_PTCR_TXCBDIS_Msk              (_U_(0x1) << PDMIC_PTCR_TXCBDIS_Pos)           /**< (PDMIC_PTCR) Transmitter Circular Buffer Disable Mask */
#define PDMIC_PTCR_TXCBDIS                  PDMIC_PTCR_TXCBDIS_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTCR_TXCBDIS_Msk instead */
#define PDMIC_PTCR_ERRCLR_Pos               24                                             /**< (PDMIC_PTCR) Transfer Bus Error Clear Position */
#define PDMIC_PTCR_ERRCLR_Msk               (_U_(0x1) << PDMIC_PTCR_ERRCLR_Pos)            /**< (PDMIC_PTCR) Transfer Bus Error Clear Mask */
#define PDMIC_PTCR_ERRCLR                   PDMIC_PTCR_ERRCLR_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTCR_ERRCLR_Msk instead */
#define PDMIC_PTCR_MASK                     _U_(0x10F0303)                                 /**< \deprecated (PDMIC_PTCR) Register MASK  (Use PDMIC_PTCR_Msk instead)  */
#define PDMIC_PTCR_Msk                      _U_(0x10F0303)                                 /**< (PDMIC_PTCR) Register Mask  */


/* -------- PDMIC_PTSR : (PDMIC Offset: 0x124) (R/ 32) Transfer Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t :7;                        /**< bit:  9..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t :1;                        /**< bit:     17  Reserved */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t :5;                        /**< bit: 19..23  Reserved */
    uint32_t ERR:1;                     /**< bit:     24  Transfer Bus Error                       */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PDMIC_PTSR_Type;
