ataradov/mcu-starter-projects/samg53/include/component/pdmic.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PDMIC_PTSR_OFFSET                   (0x124)                                       /**<  (PDMIC_PTSR) Transfer Status Register  Offset */

#define PDMIC_PTSR_RXTEN_Pos                0                                              /**< (PDMIC_PTSR) Receiver Transfer Enable Position */
#define PDMIC_PTSR_RXTEN_Msk                (_U_(0x1) << PDMIC_PTSR_RXTEN_Pos)             /**< (PDMIC_PTSR) Receiver Transfer Enable Mask */
#define PDMIC_PTSR_RXTEN                    PDMIC_PTSR_RXTEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTSR_RXTEN_Msk instead */
#define PDMIC_PTSR_TXTEN_Pos                8                                              /**< (PDMIC_PTSR) Transmitter Transfer Enable Position */
#define PDMIC_PTSR_TXTEN_Msk                (_U_(0x1) << PDMIC_PTSR_TXTEN_Pos)             /**< (PDMIC_PTSR) Transmitter Transfer Enable Mask */
#define PDMIC_PTSR_TXTEN                    PDMIC_PTSR_TXTEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTSR_TXTEN_Msk instead */
#define PDMIC_PTSR_RXCBEN_Pos               16                                             /**< (PDMIC_PTSR) Receiver Circular Buffer Enable Position */
#define PDMIC_PTSR_RXCBEN_Msk               (_U_(0x1) << PDMIC_PTSR_RXCBEN_Pos)            /**< (PDMIC_PTSR) Receiver Circular Buffer Enable Mask */
#define PDMIC_PTSR_RXCBEN                   PDMIC_PTSR_RXCBEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTSR_RXCBEN_Msk instead */
#define PDMIC_PTSR_TXCBEN_Pos               18                                             /**< (PDMIC_PTSR) Transmitter Circular Buffer Enable Position */
#define PDMIC_PTSR_TXCBEN_Msk               (_U_(0x1) << PDMIC_PTSR_TXCBEN_Pos)            /**< (PDMIC_PTSR) Transmitter Circular Buffer Enable Mask */
#define PDMIC_PTSR_TXCBEN                   PDMIC_PTSR_TXCBEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTSR_TXCBEN_Msk instead */
#define PDMIC_PTSR_ERR_Pos                  24                                             /**< (PDMIC_PTSR) Transfer Bus Error Position */
#define PDMIC_PTSR_ERR_Msk                  (_U_(0x1) << PDMIC_PTSR_ERR_Pos)               /**< (PDMIC_PTSR) Transfer Bus Error Mask */
#define PDMIC_PTSR_ERR                      PDMIC_PTSR_ERR_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PDMIC_PTSR_ERR_Msk instead */
#define PDMIC_PTSR_MASK                     _U_(0x1050101)                                 /**< \deprecated (PDMIC_PTSR) Register MASK  (Use PDMIC_PTSR_Msk instead)  */
#define PDMIC_PTSR_Msk                      _U_(0x1050101)                                 /**< (PDMIC_PTSR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief PDMIC hardware registers */
typedef struct {  
  __IO uint32_t PDMIC_CR;       /**< (PDMIC Offset: 0x00) Control Register */
  __IO uint32_t PDMIC_MR;       /**< (PDMIC Offset: 0x04) Mode Register */
  RoReg8  Reserved1[0xC];
  __I  uint32_t PDMIC_CDR;      /**< (PDMIC Offset: 0x14) Converted Data Register */
  __O  uint32_t PDMIC_IER;      /**< (PDMIC Offset: 0x18) Interrupt Enable Register */
  __O  uint32_t PDMIC_IDR;      /**< (PDMIC Offset: 0x1C) Interrupt Disable Register */
  __I  uint32_t PDMIC_IMR;      /**< (PDMIC Offset: 0x20) Interrupt Mask Register */
  __I  uint32_t PDMIC_ISR;      /**< (PDMIC Offset: 0x24) Interrupt Status Register */
  RoReg8  Reserved2[0x30];
  __IO uint32_t PDMIC_DSPR[2];  /**< (PDMIC Offset: 0x58) DSP Configuration Register 0 */
  RoReg8  Reserved3[0x84];
  __IO uint32_t PDMIC_WPMR;     /**< (PDMIC Offset: 0xE4) Write Protection Mode Register */
  __I  uint32_t PDMIC_WPSR;     /**< (PDMIC Offset: 0xE8) Write Protection Status Register */
  RoReg8  Reserved4[0x14];
  __IO uint32_t PDMIC_RPR;      /**< (PDMIC Offset: 0x100) Receive Pointer Register */
  __IO uint32_t PDMIC_RCR;      /**< (PDMIC Offset: 0x104) Receive Counter Register */
  RoReg8  Reserved5[0x8];
  __IO uint32_t PDMIC_RNPR;     /**< (PDMIC Offset: 0x110) Receive Next Pointer Register */
  __IO uint32_t PDMIC_RNCR;     /**< (PDMIC Offset: 0x114) Receive Next Counter Register */
  RoReg8  Reserved6[0x8];
  __O  uint32_t PDMIC_PTCR;     /**< (PDMIC Offset: 0x120) Transfer Control Register */
  __I  uint32_t PDMIC_PTSR;     /**< (PDMIC Offset: 0x124) Transfer Status Register */
} Pdmic;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief PDMIC hardware registers */
typedef struct {  
  __IO PDMIC_CR_Type                  PDMIC_CR;       /**< Offset: 0x00 (R/W  32) Control Register */
  __IO PDMIC_MR_Type                  PDMIC_MR;       /**< Offset: 0x04 (R/W  32) Mode Register */
  __I  uint32_t                       Reserved1[3];
  __I  PDMIC_CDR_Type                 PDMIC_CDR;      /**< Offset: 0x14 (R/   32) Converted Data Register */
  __O  PDMIC_IER_Type                 PDMIC_IER;      /**< Offset: 0x18 ( /W  32) Interrupt Enable Register */
  __O  PDMIC_IDR_Type                 PDMIC_IDR;      /**< Offset: 0x1C ( /W  32) Interrupt Disable Register */
  __I  PDMIC_IMR_Type                 PDMIC_IMR;      /**< Offset: 0x20 (R/   32) Interrupt Mask Register */
  __I  PDMIC_ISR_Type                 PDMIC_ISR;      /**< Offset: 0x24 (R/   32) Interrupt Status Register */
  __I  uint32_t                       Reserved2[12];
  __IO PDMIC_DSPR_Type                PDMIC_DSPR[2];  /**< Offset: 0x58 (R/W  32) DSP Configuration Register 0 */
  __I  uint32_t                       Reserved3[33];
  __IO PDMIC_WPMR_Type                PDMIC_WPMR;     /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I  PDMIC_WPSR_Type                PDMIC_WPSR;     /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I  uint32_t                       Reserved4[5];
  __IO PDMIC_RPR_Type                 PDMIC_RPR;      /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO PDMIC_RCR_Type                 PDMIC_RCR;      /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __I  uint32_t                       Reserved5[2];
  __IO PDMIC_RNPR_Type                PDMIC_RNPR;     /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO PDMIC_RNCR_Type                PDMIC_RNCR;     /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __I  uint32_t                       Reserved6[2];
  __O  PDMIC_PTCR_Type                PDMIC_PTCR;     /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I  PDMIC_PTSR_Type                PDMIC_PTSR;     /**< Offset: 0x124 (R/   32) Transfer Status Register */
} Pdmic;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Pulse Density Modulation Interface Controller */

#endif /* _SAMG53_PDMIC_COMPONENT_H_ */
